In [38]:
import pandas as pd

In [39]:
dates = pd.date_range('20180615', periods=6)

In [40]:
import pandas as pd

In [41]:
import numpy as np

In [42]:
dates = pd.date_range('20180615', periods=6)

In [43]:
dates

DatetimeIndex(['2018-06-15', '2018-06-16', '2018-06-17', '2018-06-18',
               '2018-06-19', '2018-06-20'],
              dtype='datetime64[ns]', freq='D')

In [44]:
data = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))

In [45]:
data

                   A         B         C         D
2018-06-15  0.422154  0.826989 -0.030305  0.438730
2018-06-16 -0.123047  0.495640 -1.434860 -0.203043
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-18  0.826947  2.041252  1.462267 -0.408260
2018-06-19 -0.036979 -0.716290 -0.081198 -1.281483
2018-06-20  1.610591 -0.644550 -0.706517  0.049857

In [46]:
data.shape

(6, 4)

In [47]:
data.values

array([[ 0.42215379,  0.82698893, -0.0303049 ,  0.43873017],
       [-0.12304726,  0.49564008, -1.43486049, -0.20304325],
       [-0.85355295, -3.27542619, -1.01284912,  0.45930114],
       [ 0.82694658,  2.04125163,  1.46226654, -0.40826021],
       [-0.03697895, -0.71629013, -0.08119785, -1.28148336],
       [ 1.61059056, -0.64454993, -0.70651711,  0.04985731]])

In [48]:
data.head()

                   A         B         C         D
2018-06-15  0.422154  0.826989 -0.030305  0.438730
2018-06-16 -0.123047  0.495640 -1.434860 -0.203043
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-18  0.826947  2.041252  1.462267 -0.408260
2018-06-19 -0.036979 -0.716290 -0.081198 -1.281483

In [49]:
data.head(2)

                   A         B         C         D
2018-06-15  0.422154  0.826989 -0.030305  0.438730
2018-06-16 -0.123047  0.495640 -1.434860 -0.203043

In [50]:
data.tail()

                   A         B         C         D
2018-06-16 -0.123047  0.495640 -1.434860 -0.203043
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-18  0.826947  2.041252  1.462267 -0.408260
2018-06-19 -0.036979 -0.716290 -0.081198 -1.281483
2018-06-20  1.610591 -0.644550 -0.706517  0.049857

In [51]:
data.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.307685 -0.212064 -0.300577 -0.157483
std    0.852420  1.815675  1.018578  0.649188
min   -0.853553 -3.275426 -1.434860 -1.281483
25%   -0.101530 -0.698355 -0.936266 -0.356956
50%    0.192587 -0.074455 -0.393857 -0.076593
75%    0.725748  0.744152 -0.043028  0.341512
max    1.610591  2.041252  1.462267  0.459301

In [52]:
data.T

   2018-06-15  2018-06-16  2018-06-17  2018-06-18  2018-06-19  2018-06-20
A    0.422154   -0.123047   -0.853553    0.826947   -0.036979    1.610591
B    0.826989    0.495640   -3.275426    2.041252   -0.716290   -0.644550
C   -0.030305   -1.434860   -1.012849    1.462267   -0.081198   -0.706517
D    0.438730   -0.203043    0.459301   -0.408260   -1.281483    0.049857

In [53]:
data.sort_index(axis=0,ascending=False)

                   A         B         C         D
2018-06-20  1.610591 -0.644550 -0.706517  0.049857
2018-06-19 -0.036979 -0.716290 -0.081198 -1.281483
2018-06-18  0.826947  2.041252  1.462267 -0.408260
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-16 -0.123047  0.495640 -1.434860 -0.203043
2018-06-15  0.422154  0.826989 -0.030305  0.438730

In [54]:
data[2:4]

                   A         B         C         D
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-18  0.826947  2.041252  1.462267 -0.408260

In [55]:
data.iloc[2:4]

                   A         B         C         D
2018-06-17 -0.853553 -3.275426 -1.012849  0.459301
2018-06-18  0.826947  2.041252  1.462267 -0.408260

In [56]:
data.iloc[1]

A   -0.123047
B    0.495640
C   -1.434860
D   -0.203043
Name: 2018-06-16 00:00:00, dtype: float64

In [57]:
data.iat[1,1]

0.49564007817798433

In [58]:
%timeit data.iat[1,1]

24.1 µs ± 3.3 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [59]:
data.iat[1,1]=100

In [60]:
data

                   A           B         C         D
2018-06-15  0.422154    0.826989 -0.030305  0.438730
2018-06-16 -0.123047  100.000000 -1.434860 -0.203043
2018-06-17 -0.853553   -3.275426 -1.012849  0.459301
2018-06-18  0.826947    2.041252  1.462267 -0.408260
2018-06-19 -0.036979   -0.716290 -0.081198 -1.281483
2018-06-20  1.610591   -0.644550 -0.706517  0.049857

In [61]:
%matplotlib inline
import matplotlib.pyplot as plt

In [62]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))

In [63]:
df

                   A         B         C         D
2018-06-15  1.463250  0.500309  1.132488  0.219369
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558
2018-06-18  0.316676 -1.169389  1.278982  1.223589
2018-06-19  0.630835  0.504424 -0.423277 -1.071047
2018-06-20  1.218554  0.278207  0.023285 -0.295998

In [64]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2018-06-15  1.463250  0.500309  1.132488  0.219369 NaN
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189 NaN
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558 NaN
2018-06-18  0.316676 -1.169389  1.278982  1.223589 NaN

In [65]:
df1.loc[dates[1:3],'E']=2
df1

                   A         B         C         D    E
2018-06-15  1.463250  0.500309  1.132488  0.219369  NaN
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189  2.0
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558  2.0
2018-06-18  0.316676 -1.169389  1.278982  1.223589  NaN

In [66]:
df1.dropna()

                   A         B         C         D    E
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189  2.0
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558  2.0

In [67]:
df1.fillna(value=5)

                   A         B         C         D    E
2018-06-15  1.463250  0.500309  1.132488  0.219369  5.0
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189  2.0
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558  2.0
2018-06-18  0.316676 -1.169389  1.278982  1.223589  5.0

In [68]:
pd.isnull(df1).any()

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [69]:
df1.mean()

A    0.229617
B   -0.353387
C    0.844579
D    0.338582
E    2.000000
dtype: float64

In [70]:
df1.mean(axis=1)

2018-06-15    0.828854
2018-06-16    0.459886
2018-06-17    0.194572
2018-06-18    0.412464
Freq: D, dtype: float64

In [71]:
df.apply(lambda x : x.max()-x.min())

A    2.022685
B    1.673814
C    2.074493
D    2.294636
dtype: float64

In [72]:
df1 = pd.concat([df.iloc[:2],df.iloc[2:]])
df1

                   A         B         C         D
2018-06-15  1.463250  0.500309  1.132488  0.219369
2018-06-16 -0.302025 -0.368025  1.520669 -0.551189
2018-06-17 -0.559434 -0.376443 -0.553823  0.462558
2018-06-18  0.316676 -1.169389  1.278982  1.223589
2018-06-19  0.630835  0.504424 -0.423277 -1.071047
2018-06-20  1.218554  0.278207  0.023285 -0.295998

In [73]:
tuples = list(zip(*[['bar', 'bar', 'baz','baz',
                    'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                    'one', 'two', 'two', 'one']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'two'),
 ('qux', 'one')]

In [74]:
index = pd.MultiIndex.from_tuples(tuple, names=['first', 'second'])

TypeError: object of type 'type' has no len()